import TitleH1 from '@/app/_components/Typography/TitleH1';
import { metadata } from '@/app/page';
import { setting } from '@/lib/setting';
import React from 'react';



const Confidence = () => {

    
 
 return (
    <div>
        <TitleH1 text="Політика конфіденційності"/>
        <section>
        <h2>1. Збір і використання інформації</h2>
        <p>Клініка "Довіра" може збирати такі типи даних:</p>
        <ul>
            <li><strong>Персональні дані</strong>: ім’я, прізвище, контактний номер телефону, електронна адреса, медична інформація.</li>
            <li><strong>Інформація про візит</strong>: дата та час візитів, результати обстежень, рекомендації лікаря та інша медична інформація.</li>
            <li><strong>Технічні дані</strong>: IP-адреса, тип пристрою, тип браузера, сторінки, які ви переглядали на нашому вебсайті, ідентифікаційні файли cookie.</li>
        </ul>
    </section>

    <section>
        <h2>2. Використання даних</h2>
        <p>Зібрані дані можуть використовуватися для:</p>
        <ul>
            <li>Надання медичних послуг і консультацій;</li>
            <li>Організації та підтвердження записів на прийом;</li>
            <li>Поліпшення наших послуг і користувацького досвіду;</li>
            <li>Інформування про зміни у розкладі прийому лікарів або надання інформації про акції та нові послуги (з вашого дозволу);</li>
            <li>Відповіді на ваші запити чи скарги.</li>
        </ul>
    </section>

    <section>
        <h2>3. Захист даних</h2>
        <p>Ми вживаємо відповідних технічних і організаційних заходів для захисту ваших даних від несанкціонованого доступу, втрати або розголошення. Дані зберігаються у захищених системах з обмеженим доступом.</p>
    </section>

    <section>
        <h2>4. Зберігання даних</h2>
        <p>Ми зберігаємо ваші дані не довше, ніж це необхідно для виконання наших зобов’язань або вимог законодавства.</p>
    </section>

    <section>
        <h2>5. Передача даних третім особам</h2>
        <p>Ми не продаємо і не передаємо ваші дані третім особам, за винятком випадків, коли це необхідно для надання медичних послуг або відповідає законодавству. Доступ до ваших даних можуть мати:</p>
        <ul>
            <li>Авторизовані лікарі та медичний персонал клініки;</li>
            <li>Сервісні компанії, які обробляють дані від нашого імені (наприклад, IT-підтримка), за умови, що вони дотримуються цієї Політики конфіденційності.</li>
        </ul>
    </section>

    <section>
        <h2>6. Права користувача</h2>
        <p>Ви маєте право на:</p>
        <ul>
            <li>Доступ до своїх персональних даних;</li>
            <li>Виправлення неточностей у своїх даних;</li>
            <li>Видалення своїх даних у межах, дозволених законодавством;</li>
            <li>Відкликання згоди на обробку даних, якщо вона була надана добровільно.</li>
        </ul>
    </section>

    <section>
        <h2>7. Використання файлів cookie</h2>
        <p>Наш вебсайт використовує файли cookie для поліпшення користувацького досвіду та надання відповідного контенту. Ви можете відключити файли cookie в налаштуваннях браузера, але деякі функції сайту можуть стати недоступними.</p>
    </section>

    <section>
        <h2>8. Зміни в Політиці конфіденційності</h2>
        <p>Ми залишаємо за собою право вносити зміни в цю Політику конфіденційності. Про важливі зміни ми повідомимо вас на нашому вебсайті або іншим відповідним способом.</p>
    </section>

    <section>
        <h2>9. Контактна інформація</h2>
        <p>Якщо у вас виникли питання щодо Політики конфіденційності, звертайтеся до нас за адресою:</p>
        <p><strong>{setting.fullTitle}</strong></p>
        <p>{setting.adress}</p>
        <p>{setting.phone_primery}</p>
        <p>{setting.schedulle}</p>
    </section>

        </div>
  );
};

export default Confidence;